#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	int a = -1;
//	int b = a >> 1;
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	int b = a << 1;
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
//	//& - 按2进制位与   ,只有同时为1才为1，其他都为0
//	/*int a = 3;
//	int b = 5;
//	int c = a&b;*/
//	//000000000000000000000000000000011
//	//000000000000000000000000000000101
//	//000000000000000000000000000000001
//	
//	// | 按位或，一个位1就为1
//	/*int a = 3;
//	int b = 5;
//	int c = a | b;*/
//	//000000000000000000000000000000011
//	//000000000000000000000000000000101
//	//000000000000000000000000000000111
//
//	//按位异或，相同为0，相异为1
//	//int c = a ^ b;
//	//000000000000000000000000000000011
//	//000000000000000000000000000000101
//	//000000000000000000000000000000110
//	return 0;
//}

//不设置临时变量，交换两个数
//int main()
//{ 
//	int a = 3;
//	int b = 5;
//
//	//加减法 --有缺点：可能会溢出
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//
//	//异或的方法
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("%d %d\n", a , b);
//	return 0;
//}

int main()
{
	//统计num的补码中有几个1,缺点：num为负数不能计算
	/*while (num)
	{
		if (num % 2 == 1)
		{
			count++;
			num = num / 2;
		}
	}*/

	//32 bit
	//num&1 == 1
	//000000000000000000000000011
	//000000000000000000000000001
	//000 00000000000000000000000
	int num = 0;
	int count = 0;
	scanf("%d", &num);
	int i = 0;

	for (i = 0; i < 32; i++)
	{
		if (((num >> i) & 1) == 1)
			count++;
	}
	printf("%d\n", count);
	return 0;
}