#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
//int main() 
//{
//	int a =20;
//	//0000 0000 0000 0000 0000 0000 0001 0100 - 原码
//	//0000 0000 0000 0000 0000 0000 0001 0100 - 反码
//	//0000 0000 0000 0000 0000 0000 0001 0100 - 补码
//	//0x00000014
//	int b = -10;
//	//1000 0000 0000 0000 0000 0000 0000 1010 - 原码
//	//1111 1111 1111 1111 1111 1111 1111 0101 - 反码
//	//1111 1111 1111 1111 1111 1111 1111 0111 - 补码
//	//0xfffffff6
//	return 0;
//}

//写段代码告诉我当前编译器的字节序是什么
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//		return 1;
//	else
//		return 0;
//}

//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	return *p;
//}

//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}

//int main()
//{
//	//返回1  小端
//	//返回0  大端
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小段\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	//1000000000000000000000000000001
//	//1111111111111111111111111111110
//	//1111111111111111111111111111111
//	//11111111
//	//char只占一个字节，只截取后8位，打印的时候整形提升，最高位是1，补够32位，再取原码打印
//
//	unsigned char c = -1;
//	//11111111
//	//无符号高位直接补0
//	//0000000000000000000000011111111 -- 255
//	//原 反 补 相同
//	return 0;
//}

//int main()
//{
//	char a = 128;
//	//1000000000000000000000010000000
//	//1111111111111111111111101111111
//	//1111111111111111111111110000000
//	//10000000
//	//整形提升
//	//1111111111111111111111110000000
//	//1111111111111111111111101111111
//	//1000000000000000000000010000000
//	printf("%d\n", a);//-128 1000000000000000000000010000000
//	printf("%u\n", a);//4294967168  1111111111111111111111110000000  整形提升后直接打印
//	//%d - 打印十进制有符号数字
//	//%u - 打印十进制无符号数字
//	return 0;
//}

//int main()
//{
//    char a = -128;
//	char b = 128;//-128 = 127+1 = 128
//	printf("%u %u\n", a, b);
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n", i + j);//按照补码形式进行运算，最后格式化为有符号的整数
//	//1000000 00000000 00000000 00010100
//	//1111111 11111111 11111111 11101011
//	//1111111 11111111 11111111 11101100 补码
//	//0000000 00000000 00000000 00001010 补码
//	//1111111 11111111 11111111 11110110 结果
//	//1111111 11111111 11111111 11110101
//	//1000000 00000000 00000000 00001010  -10
//	return 0;
//}

//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);//死循环
//	}
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));//255
//	return 0;
//}

//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");//255+1 = 0
//	}
//	return 0;
//}

int main()
{
	int n = 9;
	float *pFloat = (float *)&n;
	printf("n的值为：%d\n", n);//9
	printf("*pFloat的值为：%f\n", *pFloat);//0.000000

	*pFloat = 9.0;
	printf("num的值：%d\n", n);//1091567616
	printf("*pFloat的值为：%f\n", *pFloat);//9.000000
	return 0;
}