#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	//int a = 0;
//	//char b = 'w';
//	//int arr[10] = { 0 };
//
//	//printf("%d\n", sizeof(a));
//	//printf("%d\n", sizeof(int));
//
//	//printf("%d\n", sizeof(b));
//	//printf("%d\n", sizeof(char));
//
//	//printf("%d\n", sizeof(arr));//10*4 = 40
//	//printf("%d\n", sizeof(int [10]));
//	return 0;
//}

//int main()
//{
//	int a = 11;
//	a = a | (1 << 2);
//	printf("%d\n", a);
//	a = a & (~(1 << 2));
//	printf("%d\n", a);
//	//000000000000000000000000001011
//	//000000000000000000000000000100
//	//1<<2
//	//000000000000000000000000001111
//	//111111111111111111111111111011
//	//000000000000000000000000000100
//	//000000000000000000000000001011
//
//	//int a = 0;
//	//按2进制位取反
//	//000000000000000000000000000000
//	//111111111111111111111111111111 -- 补码
//	//111111111111111111111111111110 -- 反码
//	//100000000000000000000000000001 -- 原码
//	//printf("%d\n", ~a);//-1
//	return 0;
//}

//int main()
//{
//	int a = 1;
//	printf("%d\n", a++);//1
//	printf("%d\n", ++a);//2
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a && b;//逻辑或的关系，左边为真，右边不需要算 
//	               //l逻辑与的关系，左边为假，右边不需要算
//	printf("%d\n", c);
//}

//int get_max(int x, int y)
//{
//	if (x > y)
//		return x;
//	else
//		return y;
//}
//
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int max = get_max(a, b);
//	//调用函数的时候()就是函数调用操作符
//	printf("max = %d\n", max);
//	return 0;
//}

//struct Stu是和 int float 一样，都是一种类型，都可以创建变量
//struct Stu
//{
//	//成员变量
//	char name[20];
//	int age;
//	char id[20];
//};
//
//int main()
//{
//	//使用sturct Stu 这个结结构体类型，创建了一个学生对象s1,并初始化
//	struct Stu s1 = {"张森", 24, "1996"};
//	struct Stu* p1 = &s1;
//	printf("%d\n", p1->age);
//	printf("%s\n", p1->id);
//	printf("%s\n", p1->name);
//	//结构体指针->成员名
//
//	/*printf("%s\n", s1.name);
//	printf("%d\n", s1.age);
//	printf("%s\n", s1.id);
//	//结构体变量.成员名*/
//	return 0;
//}

//整形提升
//int main()
//{
//	char a = 3;
//	//00000000000000000000000000000011
//	//00000011  -  a
//
//	char b = 127;
//	//00000000000000000000000001111111
//	//01111111   -  b
//
//	//a+b
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//00000000000000000000000010000010
//	char c = a + b;
//	//10000010 - c   补够32位。最高为几就补几
//	//11111111111111111111111110000010   --  补码
//	//11111111111111111111111110000001   --- 反码
//	//10000000000000000000000001111110  --- 原码
//
//    //计算两个整数相加，都要转换成CPU的内整形的标准长度
//	printf("%d\n", c);
//	return 0;
//}

//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	printf("%u\n", sizeof(+c));//4
//	printf("%u\n", sizeof(!c));//1
//	//只要c参与表达式运算，就会发生整形提升，所以sizeof(+c)是4个字节
//	return 0;
//}


